# Округление десятичного числа
n = round(2.5)
print("Округление 2.5 =", n)

n = round(5.6787, 2)
print("Округление 5.6787 до двух знаков после запятой =", n)

# Модуль числа / abs
m = abs(100.23)
print("Модуль числа 100.23 =", m)

m = abs(-100.23)
print("Модуль числа -100.23 =", m)

# Возведение в сетпень / pow(число/степень)
p = pow(5,3)
print("5 в степени 3 =", p)

p = pow(25,0.5)
print("25 в корне(степень 0.5)", p)

# Проверка на int / is_integer()
n = 3.5
print(n.is_integer())

n = 1.0
print(1==1.0)
print(n.is_integer())

# Форматирование
print("\nФорматирование:")
n = 5.1234
print(f"Значение переменной n = {n}")
b = 20
print(f"Значение переменной b = {b:,.3f}")
c = 20.14
print(f"Значение переменной c = {c:.3f}")

d = 123456789
print(f"Значение переменной d = {d:.1f}")
print(f"Значение переменной d = {d:,}")

percent = 0.65
print(f"Вероятность вашей победы {percent:.1%}")